app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" LIMIT 10 OFFSET 0
---
  def index
    @courses = Course.paginate(page:params[:page])

INSERT INTO "courses" ("content", "created_at", "gsm", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Ruby on Rails"], ["created_at", Sat, 01 Feb 2014 14:51:25 UTC +00:00], ["gsm", "1234"], ["name", "Ror"], ["updated_at", Sat, 01 Feb 2014 14:51:25 UTC +00:00]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save