app/controllers/students_controller.rb

INSERT INTO "students" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 01 Feb 2014 14:13:01 UTC +00:00], ["name", "Hüseyin Yaşar"], ["updated_at", Sat, 01 Feb 2014 14:13:01 UTC +00:00]]
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save