app/controllers/teachers_controller.rb

  def index
    @teachers = Teacher.all
---
SELECT "teachers".* FROM "teachers"

  def create
    @teacher = Teacher.new(teacher_params)

    respond_to do |format|
      if @teacher.save
---
INSERT INTO "teachers" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 01 Feb 2014 13:45:24 UTC +00:00], ["name", "Muhammed Dilek"], ["updated_at", Sat, 01 Feb 2014 13:45:24 UTC +00:00]]

    def set_teacher
      @teacher = Teacher.find(params[:id])
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", "1"]]